api/modules/v1/models/User.php

SELECT * FROM `user` WHERE `username`='TiagoCrispim'
---
    public static function findByUsername($username)
    {
        $user = self::find()->where(["username" => $username])->one();