common/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);
---
SELECT * FROM `user` WHERE `auth_key`='4OIKPC5mKObfP2mxFIQoQwj6Tolxa5pk/'