common/models/User.php

SELECT * FROM `user` WHERE `auth_key`='7uW6F5peee4SO-cqicISOSC9BAhaV7TL'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);