api/modules/v1/controllers/EquipaController.php

    public function actionCriarequipa(){
        $equipa = new \common\models\Equipa();
        $equipa->id_criador=Yii::$app->request->post('id_criador');
        $equipa->nome = Yii::$app->request->post('name');
        $equipa->save();
---
INSERT INTO `equipa` (`id_criador`, `nome`) VALUES (1, 'equipaj')

    public function actionCriarjogo(){

        $id_criador=Yii::$app->request->post('id_criador');
        $equipas=Equipa::findBySql('SELECT * FROM equipa WHERE id_criador='.$id_criador.' ORDER BY ID DESC LIMIT 2')->all();

        $equipa1=$equipas[0];
        $id_equipa1=$equipa1->id;

        $equipa2=$equipas[1];
        $id_equipa2=$equipa2->id;

        $jogo= new Jogo();
        $jogo->local=Yii::$app->request->post('local');
        $jogo->hora=Yii::$app->request->post('hora');
        $jogo->data=Yii::$app->request->post('data');
        $jogo->id_equipa1=$id_equipa1;
        $jogo->id_equipa2=$id_equipa2;
        $jogo->save(false);

        $players_1=EquipaUser::find()
            ->select(['id_user'])
            ->where (['id_equipa'=>$id_equipa1])
            ->all();

        $players_2=EquipaUser::find()
            ->select(['id_user'])
            ->where (['id_equipa'=>$id_equipa2])
            ->all();
---
INSERT INTO `jogo` (`local`, `hora`, `data`, `id_equipa1`, `id_equipa2`) VALUES ('Sporting Torres', '4:02', '2019-02-11', 20, 19)
SELECT `id_user` FROM `equipa_user` WHERE `id_equipa`=20
SELECT `id_user` FROM `equipa_user` WHERE `id_equipa`=19