api/modules/v1/controllers/UserController.php

    public function actionRegisto(){
        $user = new User();
        $user->username = $this->username;
        $user->nome = $this->nome;
        $user->dataNascimento = $this->dataNascimento;
        $user->email = $this->email;
        $user->nacionalidade = $this->nacionalidade;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->save(false);
---
INSERT INTO `user` (`username`, `nome`, `dataNascimento`, `email`, `nacionalidade`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('dbshaj', 'dbsjsjs', '2000-05-26', 'djsjsdhzbzbsbj@sjksxnnznkss.xnndnssmsmsmma', 'xbdjsnsjjsnzbzb', '$2y$13$dA1MMM693sQYw3U6fBsV6OSpw7WmqFrLd9yptyyISRMiQVIvvEKES', 'VmGoiW8SpUbb4whY9Mm923f5Vw0WWg6B', 10, 1548675436, 1548675436)